app/controllers/stories_controller.rb

  def show
    @stories = Story.where(user_id: current_user.id)
---
SELECT "stories".* FROM "stories" WHERE "stories"."user_id" = ?  [["user_id", 4]]

  def create

    @story = Story.new(story_params)
    @story.user = current_user
    respond_to do |format|
      if @story.save
---
INSERT INTO "stories" ("title", "picture", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

    def set_story
      @stories = Story.find(params[:id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]